[
    {
        "id": 1,
        "nama_cafe": "Resto Chinese Food",
        "rating": 4,
        "imageName": "1.jpg",
        "isFavorite": true,
        "isBad": false,
        "address": "Surabaya",
        "coordinates": {
          "latitude": -7.285038,
          "longitude": 112.692533
    },
        "details": "Resto chinese food that already been built since 19xx, best part is the fried roll, it is not too greasy and there so much of meat juice that appear when you bite it, it is just so good"
    },
    {
        "id": 2,
        "nama_cafe": "Resto Italian Food",
        "rating": 5,
        "imageName": "2.jpg",
        "isFavorite": true,
        "isBad": false,
        "address": "Surabaya",
        "coordinates": {
          "latitude": -7.298516,
          "longitude": 112.741510
    },
        "details": "The best food that you will ever have, the pasta is excelent with the cream that soak in it, and don't forget the pizza, the pizza is great with the melting cheese all over it. And also a cozy place to hang out with your friends."
    },
    {
        "id": 3,
        "nama_cafe": "Seafood Resto",
        "rating": 3,
        "imageName": "3.jpg",
        "isFavorite": false,
        "isBad": false,
        "address": "Surabaya",
        "coordinates": {
          "latitude": -7.284885,
          "longitude": 112.694608
    },
        "details": "Seafood resto with lot of seafood menu to choose from, with fresh seafood that you will served to the best with lot of different sauce and side menu to raise the taste of main menu. It is a good place to make a dinner with your family, and not the rowdy kind of place."
    },
    {
        "id": 4,
        "nama_cafe": "Seafood Resto V2.0",
        "rating": 4,
        "imageName": "4.jpg",
        "isFavorite": true,
        "isBad": false,
        "address": "Surabaya",
        "coordinates": {
          "latitude": -7.293671,
          "longitude": 112.706712
    },
        "details": "Seafood resto with lot of fresh seafood from fish to clam, and of course the best of all crab to choose from. The best seller of this resto is the black pepper crab, there is nice kick of spicy taste when you try it, and there also grilled fish with a really nice fragrance that you will droll just from smelling it from a far"
    },
    {
        "id": 5,
        "nama_cafe": "Resto Japanese Foods",
        "rating": 2.9,
        "imageName": "5.jpg",
        "isFavorite": false,
        "isBad": true,
        "address": "Surabaya",
        "coordinates": {
          "latitude": -7.262998,
          "longitude": 112.739185
    },
        "details": "Well not only this resto have of course ramen, there also fried rice that you can choose. The ramen is good but the best one is the fried rice. Better to buy fried rice than the ramen, but you can have ramen with fried rice for a set price. so it will satisfy more of your hunger."
    },
    {
        "id": 6,
        "nama_cafe": "Japanese Foods Resto",
        "rating": 4,
        "imageName": "6.jpg",
        "isFavorite": true,
        "isBad": false,
        "address": "Surabaya",
        "coordinates": {
          "latitude": -7.263001,
          "longitude": 112.739175
    },
        "details": "This resto serve differenet kind of udon and lot of tempura too. The best menu to choose from is the kitsune udon if you like to have the light kind of soup, and don't forget to try the beef croquette where when you bite it you can taste the crunchyness with juicy flavour on top of it."
    },
]
